In [ ]:
!pip install --upgrade pandas
import pandas as pd
import numpy as np
import seaborn as sns

Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (1.3.3)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.3 in /usr/local/lib/python3.7/dist-packages (from pandas) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [ ]:
pd.__version__
pd.options.display.float_format='{:,.3f}'.format
df=sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0        16.990 1.010  Female     No   Sun  Dinner     2
1        10.340 1.660    Male     No   Sun  Dinner     3
2        21.010 3.500    Male     No   Sun  Dinner     3
3        23.680 3.310    Male     No   Sun  Dinner     2
4        24.590 3.610  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239      29.030 5.920    Male     No   Sat  Dinner     3
240      27.180 2.000  Female    Yes   Sat  Dinner     2
241      22.670 2.000    Male    Yes   Sat  Dinner     2
242      17.820 1.750    Male     No   Sat  Dinner     2
243      18.780 3.000  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [ ]:
df.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [ ]:
df.size

1708

In [ ]:
df.shape

(244, 7)

In [ ]:
df=df.rename(columns={'size':'porcion'})
df

     total_bill   tip     sex smoker   day    time  porcion
0        16.990 1.010  Female     No   Sun  Dinner        2
1        10.340 1.660    Male     No   Sun  Dinner        3
2        21.010 3.500    Male     No   Sun  Dinner        3
3        23.680 3.310    Male     No   Sun  Dinner        2
4        24.590 3.610  Female     No   Sun  Dinner        4
..          ...   ...     ...    ...   ...     ...      ...
239      29.030 5.920    Male     No   Sat  Dinner        3
240      27.180 2.000  Female    Yes   Sat  Dinner        2
241      22.670 2.000    Male    Yes   Sat  Dinner        2
242      17.820 1.750    Male     No   Sat  Dinner        2
243      18.780 3.000  Female     No  Thur  Dinner        2

[244 rows x 7 columns]

In [ ]:
distribution_values=df.describe(include=[np.number])
distribution_values.T

             count   mean   std   min    25%    50%    75%    max
total_bill 244.000 19.786 8.902 3.070 13.348 17.795 24.127 50.810
tip        244.000  2.998 1.384 1.000  2.000  2.900  3.562 10.000
porcion    244.000  2.570 0.951 1.000  2.000  2.000  3.000  6.000

Quienes pagan mas : Los Hombres

In [ ]:
df.groupby(['sex'])[['total_bill','tip']].describe()

       total_bill                            ...   tip
            count   mean   std   min    25%  ...   min   25%   50%   75%    max
sex                                          ...
Male      157.000 20.744 9.246 7.250 14.000  ... 1.000 2.000 3.000 3.760 10.000
Female     87.000 18.057 8.009 3.070 12.750  ... 1.000 2.000 2.750 3.500  6.500

[2 rows x 16 columns]

En que horarios se dan las mayores propinas

In [ ]:
df.groupby(['time','sex'])[['tip','porcion']].sum()

                  tip  porcion
time   sex
Lunch  Male    95.110       78
       Female  90.400       86
Dinner Male   389.960      335
       Female 156.110      128

Cantidad de fumadores por genero

In [ ]:
df.groupby(['smoker','sex']).count().drop(columns=['porcion','time','total_bill','tip']).rename(columns={'day':'quantity'})

               quantity
smoker sex
Yes    Male          60
       Female        33
No     Male          97
       Female        54

En que dia se recauda mas dinero

In [ ]:
df_max=df.groupby(['day'])[['total_bill']].sum()
x=df_max['total_bill'].idxmax()
df_max.loc[x].to_frame()

                 Sat
total_bill 1,778.400

En que horario se recauda mas dinero

In [ ]:
df_max.loc[[x]]

     total_bill
day
Sat   1,778.400